app/views/articles/index.html.erb

SELECT COUNT(*) FROM "comments"
---
<p> This blog has a whopping <%= Article.public_count %> articles and counting ! <br>
It also happens to have <%= pluralize Comment.count, "supportive comment" %>, how wholesome !</p>